# ============================================================
# 튜플 자료형 : 변경할 수 없는 리스트
# ============================================================

# 비어있는 튜플 만들기
tu1 = tuple()
tu2 = ()

print(tu1, type(tu1)) # () <class 'tuple'>
print(tu2, type(tu2)) # () <class 'tuple'>

# 요소가 하나만 있는 튜플 만들기 -> 그냥 괄호 안에 숫자만 넣으면 int형이 되므로 콤마를 써줘야한다.
tu1 = (1) 
tu2 = (1,) 

print(tu1, type(tu1))  # 1 <class 'int'>
print(tu2, type(tu2)) # (1,) <class 'tuple'>


# 튜플은 수정이 되지 않는다.

# ============================================================
# 튜플의 인덱싱과 슬라이싱
# 리스트와 마찬가지로 인덱싱과 슬라이싱은 가능하다.
# ============================================================

tu = (0, 1, 2, 3, 4, 5)

# 인덱싱
print(tu[0]) # 0
print(tu[2]) # 2
print(tu[-1]) # 5
print(tu[-3]) # 3

# 슬라이싱
print(tu[0:2]) #(0, 1)

# ============================================================
# 튜플의 연산
# ============================================================

tu1 = (0, 1, 2) 
tu2 = (3, 4, 5)

print(tu1 + tu2) # (0, 1, 2, 3, 4, 5)
print(tu1 * 5) # (0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2)

# 추가적으로 튜플의 길이 구하기
print(len(tu1)) # 3
