# ==================================================
# 딕셔너리 : 키와 값의 쌍으로 이루어진 자료형
# ==================================================

# 빈 딕셔너리 만들기
di1 = dict()
di2 = {}

print(di1, type(di1)) # {} <class 'dict'>
print(di2, type(di2)) # {} <class 'dict'>

# key와 value가 있는 딕셔너리
di = {'name' : '홍길동', 'age' : 24}
print(di) # {'name': '홍길동', 'age': 24}

di = {'name' : '홍길동', 'score' : [10, 20, 30, 40]}
print(di) # {'name': '홍길동', 'score': [10, 20, 30, 40]}


# ==================================================
# 딕셔너리 값을 추가하거나 삭제하기
# ==================================================

di = {'name' : '홍길동', 'age' : 24}

# 추가
di['gender'] = 'male'
print(di) # {'name': '홍길동', 'age': 24, 'gender': 'male'}

# 삭제
del di['gender']
print(di) # {'name': '홍길동', 'age': 24}

# ==================================================
# 딕셔너리 사용하기
# ==================================================

di = {'손흥민' : '축구', '김연아' : '피겨', '류현진' : '야구'}

# key값을 사용하여 value 출력하기
print(di['손흥민']) # 축구
print(di['김연아']) # 피겨
print(di['류현진']) # 야구

# 딕셔너리 만들 때 주의사항
# key값이 중복된다면 하나를 제외한 모든 값은 무시된다.
di = {'손흥민' : '축구', '손흥민' : '토트넘'}
print(di) # {'손흥민': '토트넘'}

# ==================================================
# 딕셔너리 관련 함수
# ==================================================

di = {'손흥민' : '축구', '김연아' : '피겨', '류현진' : '야구'}

# key값을 리스트로 만들기
key = di.keys()
print(key) # dict_keys(['손흥민', '김연아', '류현진'])
print(list(key)) # ['손흥민', '김연아', '류현진']

# value값을 리스트로 만들기
val = di.values()
print(val) # dict_values(['축구', '피겨', '야구'])
print(list(val)) # ['축구', '피겨', '야구']

# key와 value 쌍 얻기
item = di.items()
print(item) # dict_items([('손흥민', '축구'), ('김연아', '피겨'), ('류현진', '야구')])
print(list(item)) # [('손흥민', '축구'), ('김연아', '피겨'), ('류현진', '야구')]

# key와 value 모두 지우기
di.clear()
print(di) # {}

# key값으로 value값 얻기
di = {'손흥민' : '축구', '김연아' : '피겨', '류현진' : '야구'}

print(di.get('손흥민')) # 축구
print(di.get('봉준호')) # None -> di['봉준호']로 value값을 얻게 되면 존재하지 않는 key이므로 에러가 발생하지만 get은 None을 반환함.
print(di.get('봉준호', '없음')) # get함수는 key값이 없을 때 default값을 지정 가능

# key값이 딕셔너리 안에 존재하는지 확인
print('손흥민' in di) # True
print('봉준호' in di) # False

# key값으로 value 얻기
val = di.pop('손흥민')
print(val) # 축구
print(di) # {'김연아': '피겨', '류현진': '야구'}



